def mask_account_cart (account,cart):
    """
    которая умеет обрабатывать информацию как о картах, так и о счетах.
    """
    pass

#Maestro 1596837868705199
#Счет 64686473678894779589
#MasterCard 7158300734726758
#Счет 35383033474447895560
#Visa Classic 6831982476737658
#Visa Platinum 8990922113665229
#Visa Gold 5999414228426353
#Счет 73654108430135874305


def get_date():
    """
    которая принимает на вход строку с датой в формате "2024-03-11T02:26:18.671407"
    и возвращает строку с датой в формате "ДД.ММ.ГГГГ"("11.03.2024").
    """
    pass


